SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG22/Include/efr32bg22_frc.h
/* Bit fields for FRC WCNTCMP4 */
#define _FRC_WCNTCMP4_RESETVALUE                           0x00000000UL                            /**< Default value for FRC_WCNTCMP4              */
#define _FRC_WCNTCMP4_MASK                                 0x00000FFFUL                            /**< Mask for FRC_WCNTCMP4                       */
#define _FRC_WCNTCMP4_SUPPLENGTH_SHIFT                     0                                       /**< Shift value for FRC_SUPPLENGTH              */
#define _FRC_WCNTCMP4_SUPPLENGTH_MASK                      0xFFFUL                                 /**< Bit mask for FRC_SUPPLENGTH                 */
#define _FRC_WCNTCMP4_SUPPLENGTH_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for FRC_WCNTCMP4               */
#define FRC_WCNTCMP4_SUPPLENGTH_DEFAULT                    (_FRC_WCNTCMP4_SUPPLENGTH_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_WCNTCMP4       */

/* Bit fields for FRC PKTBUFCTRL */
#define _FRC_PKTBUFCTRL_RESETVALUE                         0x00000000UL                                      /**< Default value for FRC_PKTBUFCTRL            */
#define _FRC_PKTBUFCTRL_MASK                               0x0103FFFFUL                                      /**< Mask for FRC_PKTBUFCTRL                     */
#define _FRC_PKTBUFCTRL_PKTBUFSTARTLOC_SHIFT               0                                                 /**< Shift value for FRC_PKTBUFSTARTLOC          */
#define _FRC_PKTBUFCTRL_PKTBUFSTARTLOC_MASK                0xFFFUL                                           /**< Bit mask for FRC_PKTBUFSTARTLOC             */
#define _FRC_PKTBUFCTRL_PKTBUFSTARTLOC_DEFAULT             0x00000000UL                                      /**< Mode DEFAULT for FRC_PKTBUFCTRL             */
#define FRC_PKTBUFCTRL_PKTBUFSTARTLOC_DEFAULT              (_FRC_PKTBUFCTRL_PKTBUFSTARTLOC_DEFAULT << 0)     /**< Shifted mode DEFAULT for FRC_PKTBUFCTRL     */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_SHIFT              12                                                /**< Shift value for FRC_PKTBUFTHRESHOLD         */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_MASK               0x3F000UL                                         /**< Bit mask for FRC_PKTBUFTHRESHOLD            */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_DEFAULT            0x00000000UL                                      /**< Mode DEFAULT for FRC_PKTBUFCTRL             */
#define FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_DEFAULT             (_FRC_PKTBUFCTRL_PKTBUFTHRESHOLD_DEFAULT << 12)   /**< Shifted mode DEFAULT for FRC_PKTBUFCTRL     */
#define FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN                   (0x1UL << 24)                                     /**< Packet Buffer Threshold Enable              */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_SHIFT            24                                                /**< Shift value for FRC_PKTBUFTHRESHOLDEN       */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_MASK             0x1000000UL                                       /**< Bit mask for FRC_PKTBUFTHRESHOLDEN          */
#define _FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_DEFAULT          0x00000000UL                                      /**< Mode DEFAULT for FRC_PKTBUFCTRL             */
#define FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_DEFAULT           (_FRC_PKTBUFCTRL_PKTBUFTHRESHOLDEN_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUFCTRL     */

/* Bit fields for FRC PKTBUFSTATUS */
#define _FRC_PKTBUFSTATUS_RESETVALUE                       0x00000000UL                                 /**< Default value for FRC_PKTBUFSTATUS          */
#define _FRC_PKTBUFSTATUS_MASK                             0x0000003FUL                                 /**< Mask for FRC_PKTBUFSTATUS                   */
#define _FRC_PKTBUFSTATUS_PKTBUFCOUNT_SHIFT                0                                            /**< Shift value for FRC_PKTBUFCOUNT             */
#define _FRC_PKTBUFSTATUS_PKTBUFCOUNT_MASK                 0x3FUL                                       /**< Bit mask for FRC_PKTBUFCOUNT                */
#define _FRC_PKTBUFSTATUS_PKTBUFCOUNT_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for FRC_PKTBUFSTATUS           */
#define FRC_PKTBUFSTATUS_PKTBUFCOUNT_DEFAULT               (_FRC_PKTBUFSTATUS_PKTBUFCOUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_PKTBUFSTATUS   */

/* Bit fields for FRC PKTBUF0 */
#define _FRC_PKTBUF0_RESETVALUE                            0x00000000UL                         /**< Default value for FRC_PKTBUF0               */
#define _FRC_PKTBUF0_MASK                                  0xFFFFFFFFUL                         /**< Mask for FRC_PKTBUF0                        */
#define _FRC_PKTBUF0_PKTBUF0_SHIFT                         0                                    /**< Shift value for FRC_PKTBUF0                 */
#define _FRC_PKTBUF0_PKTBUF0_MASK                          0xFFUL                               /**< Bit mask for FRC_PKTBUF0                    */
#define _FRC_PKTBUF0_PKTBUF0_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for FRC_PKTBUF0                */
#define FRC_PKTBUF0_PKTBUF0_DEFAULT                        (_FRC_PKTBUF0_PKTBUF0_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF0        */
#define _FRC_PKTBUF0_PKTBUF1_SHIFT                         8                                    /**< Shift value for FRC_PKTBUF1                 */
#define _FRC_PKTBUF0_PKTBUF1_MASK                          0xFF00UL                             /**< Bit mask for FRC_PKTBUF1                    */
#define _FRC_PKTBUF0_PKTBUF1_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for FRC_PKTBUF0                */
#define FRC_PKTBUF0_PKTBUF1_DEFAULT                        (_FRC_PKTBUF0_PKTBUF1_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF0        */
#define _FRC_PKTBUF0_PKTBUF2_SHIFT                         16                                   /**< Shift value for FRC_PKTBUF2                 */
#define _FRC_PKTBUF0_PKTBUF2_MASK                          0xFF0000UL                           /**< Bit mask for FRC_PKTBUF2                    */
#define _FRC_PKTBUF0_PKTBUF2_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for FRC_PKTBUF0                */
#define FRC_PKTBUF0_PKTBUF2_DEFAULT                        (_FRC_PKTBUF0_PKTBUF2_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF0        */
#define _FRC_PKTBUF0_PKTBUF3_SHIFT                         24                                   /**< Shift value for FRC_PKTBUF3                 */
#define _FRC_PKTBUF0_PKTBUF3_MASK                          0xFF000000UL                         /**< Bit mask for FRC_PKTBUF3                    */
#define _FRC_PKTBUF0_PKTBUF3_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for FRC_PKTBUF0                */
#define FRC_PKTBUF0_PKTBUF3_DEFAULT                        (_FRC_PKTBUF0_PKTBUF3_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF0        */

/* Bit fields for FRC PKTBUF1 */
#define _FRC_PKTBUF1_RESETVALUE                            0x00000000UL                         /**< Default value for FRC_PKTBUF1               */
#define _FRC_PKTBUF1_MASK                                  0xFFFFFFFFUL                         /**< Mask for FRC_PKTBUF1                        */
#define _FRC_PKTBUF1_PKTBUF4_SHIFT                         0                                    /**< Shift value for FRC_PKTBUF4                 */
#define _FRC_PKTBUF1_PKTBUF4_MASK                          0xFFUL                               /**< Bit mask for FRC_PKTBUF4                    */
#define _FRC_PKTBUF1_PKTBUF4_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for FRC_PKTBUF1                */
#define FRC_PKTBUF1_PKTBUF4_DEFAULT                        (_FRC_PKTBUF1_PKTBUF4_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF1        */
#define _FRC_PKTBUF1_PKTBUF5_SHIFT                         8                                    /**< Shift value for FRC_PKTBUF5                 */
#define _FRC_PKTBUF1_PKTBUF5_MASK                          0xFF00UL                             /**< Bit mask for FRC_PKTBUF5                    */
#define _FRC_PKTBUF1_PKTBUF5_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for FRC_PKTBUF1                */
#define FRC_PKTBUF1_PKTBUF5_DEFAULT                        (_FRC_PKTBUF1_PKTBUF5_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF1        */
#define _FRC_PKTBUF1_PKTBUF6_SHIFT                         16                                   /**< Shift value for FRC_PKTBUF6                 */
#define _FRC_PKTBUF1_PKTBUF6_MASK                          0xFF0000UL                           /**< Bit mask for FRC_PKTBUF6                    */
#define _FRC_PKTBUF1_PKTBUF6_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for FRC_PKTBUF1                */
#define FRC_PKTBUF1_PKTBUF6_DEFAULT                        (_FRC_PKTBUF1_PKTBUF6_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF1        */
#define _FRC_PKTBUF1_PKTBUF7_SHIFT                         24                                   /**< Shift value for FRC_PKTBUF7                 */
#define _FRC_PKTBUF1_PKTBUF7_MASK                          0xFF000000UL                         /**< Bit mask for FRC_PKTBUF7                    */
#define _FRC_PKTBUF1_PKTBUF7_DEFAULT                       0x00000000UL                         /**< Mode DEFAULT for FRC_PKTBUF1                */
#define FRC_PKTBUF1_PKTBUF7_DEFAULT                        (_FRC_PKTBUF1_PKTBUF7_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF1        */

/* Bit fields for FRC PKTBUF2 */
#define _FRC_PKTBUF2_RESETVALUE                            0x00000000UL                          /**< Default value for FRC_PKTBUF2               */
#define _FRC_PKTBUF2_MASK                                  0xFFFFFFFFUL                          /**< Mask for FRC_PKTBUF2                        */
#define _FRC_PKTBUF2_PKTBUF8_SHIFT                         0                                     /**< Shift value for FRC_PKTBUF8                 */
#define _FRC_PKTBUF2_PKTBUF8_MASK                          0xFFUL                                /**< Bit mask for FRC_PKTBUF8                    */
#define _FRC_PKTBUF2_PKTBUF8_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF2                */
#define FRC_PKTBUF2_PKTBUF8_DEFAULT                        (_FRC_PKTBUF2_PKTBUF8_DEFAULT << 0)   /**< Shifted mode DEFAULT for FRC_PKTBUF2        */
#define _FRC_PKTBUF2_PKTBUF9_SHIFT                         8                                     /**< Shift value for FRC_PKTBUF9                 */
#define _FRC_PKTBUF2_PKTBUF9_MASK                          0xFF00UL                              /**< Bit mask for FRC_PKTBUF9                    */
#define _FRC_PKTBUF2_PKTBUF9_DEFAULT                       0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF2                */
#define FRC_PKTBUF2_PKTBUF9_DEFAULT                        (_FRC_PKTBUF2_PKTBUF9_DEFAULT << 8)   /**< Shifted mode DEFAULT for FRC_PKTBUF2        */
#define _FRC_PKTBUF2_PKTBUF10_SHIFT                        16                                    /**< Shift value for FRC_PKTBUF10                */
#define _FRC_PKTBUF2_PKTBUF10_MASK                         0xFF0000UL                            /**< Bit mask for FRC_PKTBUF10                   */
#define _FRC_PKTBUF2_PKTBUF10_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF2                */
#define FRC_PKTBUF2_PKTBUF10_DEFAULT                       (_FRC_PKTBUF2_PKTBUF10_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF2        */
#define _FRC_PKTBUF2_PKTBUF11_SHIFT                        24                                    /**< Shift value for FRC_PKTBUF11                */
#define _FRC_PKTBUF2_PKTBUF11_MASK                         0xFF000000UL                          /**< Bit mask for FRC_PKTBUF11                   */
#define _FRC_PKTBUF2_PKTBUF11_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF2                */
#define FRC_PKTBUF2_PKTBUF11_DEFAULT                       (_FRC_PKTBUF2_PKTBUF11_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF2        */

/* Bit fields for FRC PKTBUF3 */
#define _FRC_PKTBUF3_RESETVALUE                            0x00000000UL                          /**< Default value for FRC_PKTBUF3               */
#define _FRC_PKTBUF3_MASK                                  0xFFFFFFFFUL                          /**< Mask for FRC_PKTBUF3                        */
#define _FRC_PKTBUF3_PKTBUF12_SHIFT                        0                                     /**< Shift value for FRC_PKTBUF12                */
#define _FRC_PKTBUF3_PKTBUF12_MASK                         0xFFUL                                /**< Bit mask for FRC_PKTBUF12                   */
#define _FRC_PKTBUF3_PKTBUF12_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF3                */
#define FRC_PKTBUF3_PKTBUF12_DEFAULT                       (_FRC_PKTBUF3_PKTBUF12_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF3        */
#define _FRC_PKTBUF3_PKTBUF13_SHIFT                        8                                     /**< Shift value for FRC_PKTBUF13                */
#define _FRC_PKTBUF3_PKTBUF13_MASK                         0xFF00UL                              /**< Bit mask for FRC_PKTBUF13                   */
#define _FRC_PKTBUF3_PKTBUF13_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF3                */
#define FRC_PKTBUF3_PKTBUF13_DEFAULT                       (_FRC_PKTBUF3_PKTBUF13_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF3        */
#define _FRC_PKTBUF3_PKTBUF14_SHIFT                        16                                    /**< Shift value for FRC_PKTBUF14                */
#define _FRC_PKTBUF3_PKTBUF14_MASK                         0xFF0000UL                            /**< Bit mask for FRC_PKTBUF14                   */
#define _FRC_PKTBUF3_PKTBUF14_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF3                */
#define FRC_PKTBUF3_PKTBUF14_DEFAULT                       (_FRC_PKTBUF3_PKTBUF14_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF3        */
#define _FRC_PKTBUF3_PKTBUF15_SHIFT                        24                                    /**< Shift value for FRC_PKTBUF15                */
#define _FRC_PKTBUF3_PKTBUF15_MASK                         0xFF000000UL                          /**< Bit mask for FRC_PKTBUF15                   */
#define _FRC_PKTBUF3_PKTBUF15_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF3                */
#define FRC_PKTBUF3_PKTBUF15_DEFAULT                       (_FRC_PKTBUF3_PKTBUF15_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF3        */

/* Bit fields for FRC PKTBUF4 */
#define _FRC_PKTBUF4_RESETVALUE                            0x00000000UL                          /**< Default value for FRC_PKTBUF4               */
#define _FRC_PKTBUF4_MASK                                  0xFFFFFFFFUL                          /**< Mask for FRC_PKTBUF4                        */
#define _FRC_PKTBUF4_PKTBUF16_SHIFT                        0                                     /**< Shift value for FRC_PKTBUF16                */
#define _FRC_PKTBUF4_PKTBUF16_MASK                         0xFFUL                                /**< Bit mask for FRC_PKTBUF16                   */
#define _FRC_PKTBUF4_PKTBUF16_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF4                */
#define FRC_PKTBUF4_PKTBUF16_DEFAULT                       (_FRC_PKTBUF4_PKTBUF16_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF4        */
#define _FRC_PKTBUF4_PKTBUF17_SHIFT                        8                                     /**< Shift value for FRC_PKTBUF17                */
#define _FRC_PKTBUF4_PKTBUF17_MASK                         0xFF00UL                              /**< Bit mask for FRC_PKTBUF17                   */
#define _FRC_PKTBUF4_PKTBUF17_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF4                */
#define FRC_PKTBUF4_PKTBUF17_DEFAULT                       (_FRC_PKTBUF4_PKTBUF17_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF4        */
#define _FRC_PKTBUF4_PKTBUF18_SHIFT                        16                                    /**< Shift value for FRC_PKTBUF18                */
#define _FRC_PKTBUF4_PKTBUF18_MASK                         0xFF0000UL                            /**< Bit mask for FRC_PKTBUF18                   */
#define _FRC_PKTBUF4_PKTBUF18_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF4                */
#define FRC_PKTBUF4_PKTBUF18_DEFAULT                       (_FRC_PKTBUF4_PKTBUF18_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF4        */
#define _FRC_PKTBUF4_PKTBUF19_SHIFT                        24                                    /**< Shift value for FRC_PKTBUF19                */
#define _FRC_PKTBUF4_PKTBUF19_MASK                         0xFF000000UL                          /**< Bit mask for FRC_PKTBUF19                   */
#define _FRC_PKTBUF4_PKTBUF19_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF4                */
#define FRC_PKTBUF4_PKTBUF19_DEFAULT                       (_FRC_PKTBUF4_PKTBUF19_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF4        */

/* Bit fields for FRC PKTBUF5 */
#define _FRC_PKTBUF5_RESETVALUE                            0x00000000UL                          /**< Default value for FRC_PKTBUF5               */
#define _FRC_PKTBUF5_MASK                                  0xFFFFFFFFUL                          /**< Mask for FRC_PKTBUF5                        */
#define _FRC_PKTBUF5_PKTBUF20_SHIFT                        0                                     /**< Shift value for FRC_PKTBUF20                */
#define _FRC_PKTBUF5_PKTBUF20_MASK                         0xFFUL                                /**< Bit mask for FRC_PKTBUF20                   */
#define _FRC_PKTBUF5_PKTBUF20_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF5                */
#define FRC_PKTBUF5_PKTBUF20_DEFAULT                       (_FRC_PKTBUF5_PKTBUF20_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF5        */
#define _FRC_PKTBUF5_PKTBUF21_SHIFT                        8                                     /**< Shift value for FRC_PKTBUF21                */
#define _FRC_PKTBUF5_PKTBUF21_MASK                         0xFF00UL                              /**< Bit mask for FRC_PKTBUF21                   */
#define _FRC_PKTBUF5_PKTBUF21_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF5                */
#define FRC_PKTBUF5_PKTBUF21_DEFAULT                       (_FRC_PKTBUF5_PKTBUF21_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF5        */
#define _FRC_PKTBUF5_PKTBUF22_SHIFT                        16                                    /**< Shift value for FRC_PKTBUF22                */
#define _FRC_PKTBUF5_PKTBUF22_MASK                         0xFF0000UL                            /**< Bit mask for FRC_PKTBUF22                   */
#define _FRC_PKTBUF5_PKTBUF22_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF5                */
#define FRC_PKTBUF5_PKTBUF22_DEFAULT                       (_FRC_PKTBUF5_PKTBUF22_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF5        */
#define _FRC_PKTBUF5_PKTBUF23_SHIFT                        24                                    /**< Shift value for FRC_PKTBUF23                */
#define _FRC_PKTBUF5_PKTBUF23_MASK                         0xFF000000UL                          /**< Bit mask for FRC_PKTBUF23                   */
#define _FRC_PKTBUF5_PKTBUF23_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF5                */
#define FRC_PKTBUF5_PKTBUF23_DEFAULT                       (_FRC_PKTBUF5_PKTBUF23_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF5        */

